drop view if exists პირველი;
create view პირველი as
select ID, date(თარიღი) as თარიღი, substring_index(trim(დებეტი)," ",1) as დკოდი, trim(დებეტი) as დებეტი,
substring_index(trim(კრედიტი)," ",1) as კკოდი, trim(კრედიტი) as კრედიტი,
დრაოდენობა, კრაოდენობა
from ნახევარფაბრიკატები;

drop view if exists მეორე;
create view მეორე as
select concat(ანგარიში,კოდი) as ანგარიშიკოდი, trim(დასახელება) as დასახელება, რაოდენობა
from ნახევარფაბრიკატი
where რაოდენობა is not null or რაოდენობა !=0;

drop view if exists მესამე;
create view მესამე as
select distinct * from 
(select დკოდი, დებეტი
from პირველი
where დკოდი not like "1630%"
union all
select კკოდი, კრედიტი
from პირველი
where კკოდი not like "1630%") as a; 


drop view if exists მეოთხე;
create view მეოთხე as
select *
from მეორე
union
select დკოდი, mid(დებეტი,16,char_length(დებეტი)-15) as დებეტი, 0
from მესამე
left join მეორე
on მესამე.დკოდი=მეორე.ანგარიშიკოდი
where ანგარიშიკოდი is null;

drop view if exists დებეტი;
create view დებეტი as
select დკოდი,
ifnull(sum(if(day(თარიღი)=29, დრაოდენობა,0)),0) as დებეტი_რაოდენობა1,
ifnull(sum(if(day(თარიღი)=30, დრაოდენობა,0)),0) as დებეტი_რაოდენობა2,
ifnull(sum(if(day(თარიღი)=31, დრაოდენობა,0)),0) as დებეტი_რაოდენობა3,
ifnull(sum(if(day(თარიღი)=1, დრაოდენობა,0)),0) as დებეტი_რაოდენობა4,
ifnull(sum(if(day(თარიღი)=2, დრაოდენობა,0)),0) as დებეტი_რაოდენობა5,
ifnull(sum(if(day(თარიღი)=3, დრაოდენობა,0)),0) as დებეტი_რაოდენობა6,
ifnull(sum(if(day(თარიღი)=4, დრაოდენობა,0)),0) as დებეტი_რაოდენობა7
from პირველი
group by დკოდი
having დკოდი not like "1630%";

drop view if exists კრედიტი;
create view კრედიტი as
select კკოდი,
ifnull(sum(if(day(თარიღი)=29, კრაოდენობა,0)),0) as კრედიტი_რაოდენობა1,
ifnull(sum(if(day(თარიღი)=30, კრაოდენობა,0)),0) as კრედიტი_რაოდენობა2,
ifnull(sum(if(day(თარიღი)=31, კრაოდენობა,0)),0) as კრედიტი_რაოდენობა3,
ifnull(sum(if(day(თარიღი)=1, კრაოდენობა,0)),0) as კრედიტი_რაოდენობა4,
ifnull(sum(if(day(თარიღი)=2, კრაოდენობა,0)),0) as კრედიტი_რაოდენობა5,
ifnull(sum(if(day(თარიღი)=3, კრაოდენობა,0)),0) as კრედიტი_რაოდენობა6,
ifnull(sum(if(day(თარიღი)=4, კრაოდენობა,0)),0) as კრედიტი_რაოდენობა7
from პირველი
group by კკოდი
having კკოდი not like "1630%";

drop view if exists მეხუთე;
create view მეხუთე as
select ანგარიშიკოდი, დასახელება, 
ifnull(რაოდენობა,0) as ნაშთი0, 
ifnull(დებეტი_რაოდენობა1,0) as დებეტი_რაოდენობა1, 
ifnull(კრედიტი_რაოდენობა1,0) as კრედიტი_რაოდენობა1, 
ifnull(დებეტი_რაოდენობა2,0) as დებეტი_რაოდენობა2, 
ifnull(კრედიტი_რაოდენობა2,0) as კრედიტი_რაოდენობა2, 
ifnull(დებეტი_რაოდენობა3,0) as დებეტი_რაოდენობა3, 
ifnull(კრედიტი_რაოდენობა3,0) as კრედიტი_რაოდენობა3, 
ifnull(დებეტი_რაოდენობა4,0) as დებეტი_რაოდენობა4, 
ifnull(კრედიტი_რაოდენობა4,0) as კრედიტი_რაოდენობა4, 
ifnull(დებეტი_რაოდენობა5,0) as დებეტი_რაოდენობა5, 
ifnull(კრედიტი_რაოდენობა5,0) as კრედიტი_რაოდენობა5, 
ifnull(დებეტი_რაოდენობა6,0) as დებეტი_რაოდენობა6, 
ifnull(კრედიტი_რაოდენობა6,0) as კრედიტი_რაოდენობა6, 
ifnull(დებეტი_რაოდენობა7,0) as დებეტი_რაოდენობა7, 
ifnull(კრედიტი_რაოდენობა7,0) as კრედიტი_რაოდენობა7
from მეოთხე
left join დებეტი
on მეოთხე.ანგარიშიკოდი=დებეტი.დკოდი
left join კრედიტი 
on მეოთხე.ანგარიშიკოდი=კრედიტი.კკოდი;

drop view if exists მეხუთე2;
create view მეხუთე2 as
select ანგარიშიკოდი, დასახელება, ნაშთი0,
დებეტი_რაოდენობა1, 
კრედიტი_რაოდენობა1, 
ნაშთი0+დებეტი_რაოდენობა1-კრედიტი_რაოდენობა1 as ნაშთი1,
დებეტი_რაოდენობა2, 
კრედიტი_რაოდენობა2,
ნაშთი0+დებეტი_რაოდენობა1-კრედიტი_რაოდენობა1+დებეტი_რაოდენობა2-კრედიტი_რაოდენობა2 as ნაშთი2,
დებეტი_რაოდენობა3, 
კრედიტი_რაოდენობა3, 
ნაშთი0+დებეტი_რაოდენობა1-კრედიტი_რაოდენობა1+დებეტი_რაოდენობა2-კრედიტი_რაოდენობა2+დებეტი_რაოდენობა3-კრედიტი_რაოდენობა3 as ნაშთი3,
დებეტი_რაოდენობა4, 
კრედიტი_რაოდენობა4,
ნაშთი0+დებეტი_რაოდენობა1-კრედიტი_რაოდენობა1+დებეტი_რაოდენობა2-კრედიტი_რაოდენობა2+დებეტი_რაოდენობა3-კრედიტი_რაოდენობა3+დებეტი_რაოდენობა4-კრედიტი_რაოდენობა4 as ნაშთი4,
დებეტი_რაოდენობა5, 
კრედიტი_რაოდენობა5,
ნაშთი0+დებეტი_რაოდენობა1-კრედიტი_რაოდენობა1+დებეტი_რაოდენობა2-კრედიტი_რაოდენობა2+დებეტი_რაოდენობა3-კრედიტი_რაოდენობა3+დებეტი_რაოდენობა4-კრედიტი_რაოდენობა4+დებეტი_რაოდენობა5-კრედიტი_რაოდენობა5 as ნაშთი5,
დებეტი_რაოდენობა6, 
კრედიტი_რაოდენობა6,
ნაშთი0+დებეტი_რაოდენობა1-კრედიტი_რაოდენობა1+დებეტი_რაოდენობა2-კრედიტი_რაოდენობა2+დებეტი_რაოდენობა3-კრედიტი_რაოდენობა3+დებეტი_რაოდენობა4-კრედიტი_რაოდენობა4+დებეტი_რაოდენობა5-კრედიტი_რაოდენობა5+დებეტი_რაოდენობა6-კრედიტი_რაოდენობა6 as ნაშთი6,
დებეტი_რაოდენობა7, 
კრედიტი_რაოდენობა7,
ნაშთი0+დებეტი_რაოდენობა1-კრედიტი_რაოდენობა1+დებეტი_რაოდენობა2-კრედიტი_რაოდენობა2+დებეტი_რაოდენობა3-კრედიტი_რაოდენობა3+დებეტი_რაოდენობა4-კრედიტი_რაოდენობა4+დებეტი_რაოდენობა5-კრედიტი_რაოდენობა5+დებეტი_რაოდენობა6-კრედიტი_რაოდენობა6+დებეტი_რაოდენობა7-კრედიტი_რაოდენობა7 as ნაშთი7
from მეხუთე;

drop view if exists მეექვსე;
create view მეექვსე as
select მეხუთე2.*, 
if(ნაშთი0>=1 and კრედიტი_რაოდენობა1=0 and კრედიტი_რაოდენობა2=0
or ნაშთი1>=1 and კრედიტი_რაოდენობა2=0 and კრედიტი_რაოდენობა3=0
or ნაშთი2>=1 and კრედიტი_რაოდენობა3=0 and კრედიტი_რაოდენობა4=0
or ნაშთი3>=1 and კრედიტი_რაოდენობა4=0 and კრედიტი_რაოდენობა5=0
or ნაშთი4>=1 and კრედიტი_რაოდენობა5=0 and კრედიტი_რაოდენობა6=0
or ნაშთი5>=1 and კრედიტი_რაოდენობა6=0 and კრედიტი_რაოდენობა7=0,
"Error"," ") as დარღვევა
from მეხუთე2;


select *
from მეექვსე
where დარღვევა="Error"
and დასახელება not like "%ყვავილ%" and ანგარიშიკოდი not like "1620%" and ანგარიშიკოდი not like "1640%";
