drop view if exists პირველი;
create view პირველი as
select ID, date(თარიღი) as თარიღი, დოკუმენტი, შინაარსი, დებეტი, left(trim(დებეტი),7) as დფილიალი, დდასახელება, დრაოდენობა, left(trim(კრედიტი),7) as კფილიალი, კდასახელება,კრაოდენობა
from შიდაგადაზიდვები
where შინაარსი like "%საქონლის საწყობზე გადაწერა%";

drop view if exists მეორე;
create view მეორე as
select ID, თარიღი, left(trim(დოკუმენტი),10) as დოკუმენტი, შინაარსი, დებეტი, reverse(substring_index(reverse(დებეტი),"-",1)) as კოდი, დფილიალი, ფ.ფილიალი as მიმღები, დდასახელება as დასახელება, დრაოდენობა, კფილიალი, ფ2.ფილიალი as გამგზავნი, კდასახელება, კრაოდენობა
from პირველი
join ფილიალები as ფ
on პირველი.დფილიალი=ფ.კოდი
join ფილიალები as ფ2
on პირველი.კფილიალი=ფ2.კოდი
where დოკუმენტი is not null 
and დფილიალი<>კფილიალი;


drop view if exists მესამე;
create view მესამე as
select *, date(ტრანსპორტირების_დაწყების_თარიღი) as თარიღი, 
case
when ტრანსპორტირების_დაწყება regexp "დად|იან" then "დადიანი"
when ტრანსპორტირების_დაწყება regexp "წერ|თლის" then "წერეთელი"
when ტრანსპორტირების_დაწყება regexp "პეკინ|პეკინი" then "პეკინი"
when ტრანსპორტირების_დაწყება regexp "მანდ|შტამ" then "ვარკეთილი"
when ტრანსპორტირების_დაწყება regexp "ხიზან|ზანიშ" then "გლდანი"
when ტრანსპორტირების_დაწყება regexp "ერისთ|ერისთავ" then "ერისთავი"
when ტრანსპორტირების_დაწყება regexp "ანდრო|ნიკაშვილი" then "ანდრონიკაშვილი"
when ტრანსპორტირების_დაწყება regexp "ბელია|ბელიაშვ" then "ბელიაშვილი"
when ტრანსპორტირების_დაწყება regexp "ქარელ|ქვენა" then "ქარელი"
when ტრანსპორტირების_დაწყება regexp "ნადარ|ნადარეიშ" then "ნადარეიშვილი"
end as გამგზავნი,
case
when ტრანსპორტირების_დაწყება regexp "დად|იან" then "დადიანი"
when ტრანსპორტირების_დაწყება regexp "წერ|თლის" then "წერეთელი"
when ტრანსპორტირების_დაწყება regexp "პეკინ|პეკინი" then "პეკინი"
when ტრანსპორტირების_დაწყება regexp "მანდ|შტამ" then "ვარკეთილი"
when ტრანსპორტირების_დაწყება regexp "ხიზან|ზანიშ" then "გლდანი"
when ტრანსპორტირების_დაწყება regexp "ერისთ|ერისთავ" then "ერისთავი"
when ტრანსპორტირების_დაწყება regexp "ანდრო|ნიკაშვილი" then "ანდრონიკაშვილი"
when ტრანსპორტირების_დაწყება regexp "ბელია|ბელიაშვ" then "ბელიაშვილი"
when ტრანსპორტირების_დაწყება regexp "ქარელ|ქვენა" then "ქარელი"
when ტრანსპორტირების_დაწყება regexp "ნადარ|ნადარეიშ" then "ნადარეიშვილი"
end as მიმღები
from ზედნადებები
where ტრანსპორტირების_დაწყება not like "%წინამ%" 
and ტრანსპორტირების_დაწყება not like "%მეველ%"
and ტრანსპორტირების_დაწყება not like "წერეთლის 123" 
and ტრანსპორტირების_დასრულება not like "%წინამ%"
and ტრანსპორტირების_დასრულება not like "%მეველ%" 
and ტრანსპორტირების_დასრულება not like "%წერეთლის 123%";

drop view if exists მეოთხე;
create view მეოთხე as
select თარიღი, დოკუმენტი, კოდი, დასახელება
from მეორე
union all
select თარიღი, ზედნადების_ნომერი, საქონლის_კოდი, საქონლის_დასახელება
from მესამე;

drop view if exists მეხუთე;
create view მეხუთე as
select distinct *
from მეოთხე
group by დოკუმენტი, კოდი, თარიღი;

drop view if exists მეექვსე;
create view მეექვსე as
select თარიღი, დოკუმენტი,კოდი, ifnull(sum(კრაოდენობა),0) as რაოდენობა_პროგრამა, გამგზავნი as გამგზავნი_პროგრამა, მიმღები as მიმღები_პროგრამა
from მეორე
group by დოკუმენტი, კოდი, თარიღი;


drop view if exists მეშვიდე;
create view მეშვიდე as
select თარიღი,ზედნადების_ნომერი, საქონლის_კოდი, ifnull(sum(რაოდენობა),0) as რაოდენობა_რს, გამგზავნი as გამგზავნი_რს, მიმღები as მიმღები_რს
from მესამე
group by ზედნადების_ნომერი, საქონლის_კოდი, თარიღი;

drop view if exists მერვე;
create view მერვე as
select მეხუთე.თარიღი, მეხუთე.დოკუმენტი,მეხუთე.კოდი, მეხუთე.დასახელება, 
ifnull(რაოდენობა_პროგრამა,0) as რაოდენობა_პროგრამა, 
ifnull(რაოდენობა_რს,0) as რაოდენობა_რს,
ifnull(რაოდენობა_პროგრამა,0)-ifnull(რაოდენობა_რს,0) as სხვაობა,
გამგზავნი_პროგრამა, მიმღები_პროგრამა, გამგზავნი_რს, მიმღები_რს,
if(გამგზავნი_პროგრამა=გამგზავნი_რს and მიმღები_პროგრამა=მიმღები_რს,"ფილიალი ემთხვევა","ფილიალი არ ემთხვევა") as ფილიალების_შედარება

from მეხუთე
left join მეექვსე 
using(თარიღი,დოკუმენტი,კოდი)
left join მეშვიდე
on მეხუთე.თარიღი=მეშვიდე.თარიღი
and მეხუთე.დოკუმენტი=მეშვიდე.ზედნადების_ნომერი
and მეხუთე.კოდი=მეშვიდე.საქონლის_კოდი;

select * from მერვე
where სხვაობა <>0



