drop view if exists წსნ;
create view წსნ as
select concat(შტრიხ_კოდი,date(თარიღი)) as პროდუქტისკოდი, 
date(თარიღი) as თარიღი, შტრიხ_კოდი as კოდი,მზა_პროდუქტი, რაოდენობა,
case
when საწყობი like "%გლდან%" then "გლდანი"
when საწყობი like "%დადიან%" then "ნახალოვკა"
when საწყობი like "%ვარკეთ%" then "ვარკეთილი"
when საწყობი like "%პეკინ%" then "პეკინი"
end as ოფისი
from წსნ67
where საწყობი not like "%წერეთ%";

drop view if exists არბო;
create view არბო as
select concat(if(კოდი=0,შეკვეთის_ნომერი,კოდი),date(დასრულების_დასრულება)) as პროდუქტისკოდი, 
date(დასრულების_დასრულება) as თარიღი, if(კოდი=0,შეკვეთის_ნომერი, კოდი) as კოდი,
if(დასახელება is null, "შეკვეთილი ტორტი", დასახელება) as პროდუქტი, რაოდენობა, ოფისი
from არბო67
where წაშლის_თარიღი is null
order by 1;


drop view if exists ორიგინალი;
create view ორიგინალი as
select distinct *
 from
(select პროდუქტისკოდი, თარიღი, კოდი
from არბო
union
select პროდუქტისკოდი, თარიღი, კოდი
from წსნ) as a ;

drop view if exists ჩონჩხი1;
create view ჩონჩხი1 as 
select  ორიგინალი.პროდუქტისკოდი, ორიგინალი.თარიღი, ორიგინალი.კოდი, მზა_პროდუქტი
from ორიგინალი
left join წსნ
on ორიგინალი.პროდუქტისკოდი=წსნ.პროდუქტისკოდი
group by 1;
select * from ჩონჩხი1;

drop view if exists ჩონჩხი2;
create view ჩონჩხი2 as
select ჩონჩხი1.პროდუქტისკოდი, ჩონჩხი1.თარიღი, ჩონჩხი1.კოდი, if(მზა_პროდუქტი is null, პროდუქტი, მზა_პროდუქტი) as მზა_პროდუქტი
from ჩონჩხი1
left join არბო
on ჩონჩხი1.პროდუქტისკოდი=არბო.პროდუქტისკოდი
group by 1;

drop view if exists ჩონჩხი;
create view ჩონჩხი as
select ჩონჩხი2.*, if(კოდი<2040000, "ნახევარფაბრიკატები", "მზა პროდუქცია") as კატეგორია
from ჩონჩხი2
where კოდი not between 2040100 and 2040200 
and მზა_პროდუქტი not like "%ყუთ%";

drop view if exists გლდანიარბო;
create view გლდანიარბო as 
select პროდუქტისკოდი, sum(რაოდენობა) as გლდანიარბო
from არბო
group by პროდუქტისკოდი, ოფისი
having ოფისი like "%გლდანი%";

drop view if exists ნახალოვკაარბო;
create view ნახალოვკაარბო as 
select პროდუქტისკოდი, sum(რაოდენობა) as ნახალოვკაარბო
from არბო
group by პროდუქტისკოდი, ოფისი
having ოფისი like "%ნახალოვკა%";

drop view if exists ვარკეთილიარბო;
create view ვარკეთილიარბო as 
select პროდუქტისკოდი, sum(რაოდენობა) as ვარკეთილიარბო
from არბო
group by პროდუქტისკოდი, ოფისი
having ოფისი like "%ვარკეთილი%";

drop view if exists პეკინიარბო;
create view პეკინიარბო as 
select პროდუქტისკოდი, sum(რაოდენობა) as პეკინიარბო
from არბო
group by პროდუქტისკოდი, ოფისი
having ოფისი like "%პეკინი%";

drop view if exists გლდანიწსნ;
create view გლდანიწსნ as 
select პროდუქტისკოდი, sum(რაოდენობა) as გლდანიწსნ, ოფისი
from წსნ
group by პროდუქტისკოდი, ოფისი
having ოფისი like "%გლდანი%";

drop view if exists ნახალოვკაწსნ;
create view ნახალოვკაწსნ as 
select პროდუქტისკოდი, sum(რაოდენობა) as ნახალოვკაწსნ, ოფისი
from წსნ
group by პროდუქტისკოდი, ოფისი
having ოფისი like "%ნახალოვკა%";

drop view if exists ვარკეთილიწსნ;
create view ვარკეთილიწსნ as 
select პროდუქტისკოდი, sum(რაოდენობა) as ვარკეთილიწსნ, ოფისი
from წსნ
group by პროდუქტისკოდი, ოფისი
having ოფისი like "%ვარკეთილი%";

drop view if exists პეკინიწსნ;
create view პეკინიწსნ as 
select პროდუქტისკოდი, sum(რაოდენობა) as პეკინიწსნ, ოფისი
from წსნ
group by პროდუქტისკოდი, ოფისი
having ოფისი like "%პეკინი%";

select ჩონჩხი.*, 
if(გლდანიარბო is null,0,გლდანიარბო) as გლდანიარბო,
if(ნახალოვკაარბო is null,0,ნახალოვკაარბო) as ნახალოვკაარბო,
if(ვარკეთილიარბო is null,0,ვარკეთილიარბო) as ვარკეთილიარბო,
if(პეკინიარბო is null,0,პეკინიარბო) as პეკინიარბო,
if(გლდანიწსნ is null,0,გლდანიწსნ) as გლდანიწსნ,
if(ნახალოვკაწსნ is null,0,ნახალოვკაწსნ) as ნახალოვკაწსნ,
if(ვარკეთილიწსნ is null,0,ვარკეთილიწსნ) as ვარკეთილიწსნ,
if(პეკინიწსნ is null,0,პეკინიწსნ) as პეკინიწსნ,
if(გლდანიწსნ is null,0,გლდანიწსნ)-if(გლდანიარბო is null,0,გლდანიარბო) as გლდანისხვაობა,
if(ნახალოვკაწსნ is null,0,ნახალოვკაწსნ)-if(ნახალოვკაარბო is null,0,ნახალოვკაარბო) as ნახალოვკასხვაობა, 
if(ვარკეთილიწსნ is null,0,ვარკეთილიწსნ)-if(ვარკეთილიარბო is null,0,ვარკეთილიარბო) as ვარკეთილისხვაობა,
if(პეკინიწსნ is null,0,პეკინიწსნ)-if(პეკინიარბო is null,0,პეკინიარბო) as პეკინისხვოაბა 
from ჩონჩხი
left join გლდანიარბო on ჩონჩხი.პროდუქტისკოდი=გლდანიარბო.პროდუქტისკოდი
left join ნახალოვკაარბო on ჩონჩხი.პროდუქტისკოდი=ნახალოვკაარბო.პროდუქტისკოდი
left join ვარკეთილიარბო on ჩონჩხი.პროდუქტისკოდი=ვარკეთილიარბო.პროდუქტისკოდი
left join პეკინიარბო on ჩონჩხი.პროდუქტისკოდი=პეკინიარბო.პროდუქტისკოდი
left join გლდანიწსნ on ჩონჩხი.პროდუქტისკოდი=გლდანიწსნ.პროდუქტისკოდი
left join ნახალოვკაწსნ on ჩონჩხი.პროდუქტისკოდი=ნახალოვკაწსნ.პროდუქტისკოდი
left join ვარკეთილიწსნ on ჩონჩხი.პროდუქტისკოდი=ვარკეთილიწსნ.პროდუქტისკოდი
left join პეკინიწსნ on ჩონჩხი.პროდუქტისკოდი=პეკინიწსნ.პროდუქტისკოდი